In [2]:
import pandas as pd

In [24]:
header = pd.MultiIndex.from_product([['3_Months','6_Months'],['Python','ML']])
d=([[12,45,67,56],[78,89,45,67],[45,67,89,90],[67,44,56,55]])
df = pd.DataFrame ( d ,   index=['Jony','Anil','Sunil','Rocky'], columns=header)

In [25]:
print(df)

      3_Months     6_Months
        Python  ML   Python  ML
Jony        12  45       67  56
Anil        78  89       45  67
Sunil       45  67       89  90
Rocky       67  44       56  55

In [8]:
stacked_df = df.stack(level=0)
stacked_df

                ML  Python
Jony  3_Months  45      12
      6_Months  56      67
Anil  3_Months  89      78
      6_Months  67      45
Sunil 3_Months  67      45
      6_Months  90      89
Rocky 3_Months  44      67
      6_Months  55      56

In [9]:
stacked_df = df.stack(level=1)
stacked_df

              3_Months  6_Months
Jony  ML            45        56
      Python        12        67
Anil  ML            89        67
      Python        78        45
Sunil ML            67        90
      Python        45        89
Rocky ML            44        55
      Python        67        56

In [11]:
stacked_df.loc['Jony']

        3_Months  6_Months
ML            45        56
Python        12        67

In [13]:
stacked_df.loc['Jony'].loc ['ML', '6_Months']

56

In [14]:
stacked_df.loc['Jony'].loc ['ML'].loc[ '6_Months']

56

In [21]:
stacked_df.loc['Jony'][ '6_Months'] ['ML']

56

In [15]:
stacked_df.loc['Rocky'].loc ['Python', '6_Months']

56

In [18]:
csv= pd.read_csv('sample.csv')

In [19]:
csv

  Language Unnamed: 1 Science Unnamed: 3
0      Tam        Eng     Phy       Chem
1       56         67      75         71
2       57         68      87         82
3       58         69      56         94
4       59         70      78         87
5       60         71      98         67

In [22]:
un_df=stacked_df.unstack()
un_df

      3_Months        6_Months
            ML Python       ML Python
Jony        45     12       56     67
Anil        89     78       67     45
Sunil       67     45       90     89
Rocky       44     67       55     56